wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
    retval = sd_ble_gap_adv_set_configure(&sBle.mAdvHandle, &sBle.mAdvDataInfo, &params);
    otEXPECT_ACTION(retval == NRF_SUCCESS, otLogInfoPlat("[BLE]: sd_ble_gap_adv_set_configure error: 0x%x", retval));

    retval = sd_ble_gap_adv_start(sBle.mAdvHandle, BLE_CFG_TAG);
    otEXPECT_ACTION(retval == NRF_SUCCESS, otLogInfoPlat("[BLE]: sd_ble_gap_adv_start error: 0x%x", retval));

    sBle.mAdvInterval = aInterval;
    sBle.mAdvType     = aType;
    sBle.mState       = kStateAdvertising;

exit:
    return nrf5SdErrorToOtError(retval);
}

otError otPlatTobleGapAdvStop(otInstance *aInstance)
{
    uint32_t retval;

    OT_UNUSED_VARIABLE(aInstance);

    retval = sd_ble_gap_adv_stop(sBle.mAdvHandle);
    otEXPECT_ACTION(retval == NRF_SUCCESS, otLogInfoPlat("[BLE]: sd_ble_gap_adv_stop error: 0x%x", retval));

exit:
    return nrf5SdErrorToOtError(retval);
}

otError otPlatTobleGapScanStart(otInstance *aInstance, uint16_t aInterval, uint16_t aWindow, bool aActive)
{
    uint32_t              retval;
    ble_gap_scan_params_t params;
    ble_data_t            advData;

    OT_UNUSED_VARIABLE(aInstance);

    memset(&params, 0, sizeof(ble_gap_scan_params_t));
    params.active        = aActive;
    params.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
    params.interval      = MS_TO_BLE_TIME_UNIT(aInterval);
    params.window        = MS_TO_BLE_TIME_UNIT(aWindow);
    params.timeout       = BLE_GAP_SCAN_TIMEOUT_UNLIMITED;
    params.scan_phys     = BLE_GAP_PHY_1MBPS;

    advData.p_data = sBle.mScanBuff;
    advData.len    = sizeof(sBle.mScanBuff);

    if ((retval = sd_ble_gap_scan_start(&params, &advData)) != NRF_SUCCESS)
    {
        otLogInfoPlat("[BLE]: sd_ble_gap_scan_start error: 0x%x", retval);
    }

    return nrf5SdErrorToOtError(retval);
}

otError otPlatTobleGapScanStop(otInstance *aInstance)
{
    uint32_t retval;

    OT_UNUSED_VARIABLE(aInstance);

    if ((retval = sd_ble_gap_scan_stop()) != NRF_SUCCESS)
    {
        otLogInfoPlat("[BLE]: sd_ble_gap_scan_stop error: 0x%x", retval);
    }

    return nrf5SdErrorToOtError(retval);
}

otTobleConnection *otPlatTobleCreateConnection(otInstance *             aInstance,
                                               const otTobleAddress *   aPeerAddress,
                                               otTobleConnectionConfig *aConfig)
{
    uint32_t              retval;
    ble_gap_addr_t        addr;
    ble_gap_scan_params_t scanParams;
    ble_gap_conn_params_t connParams;

    OT_UNUSED_VARIABLE(aInstance);

    otEXPECT_ACTION(sPeripheralPeer == NULL, retval = NRF_ERROR_INVALID_STATE);
    otEXPECT_ACTION(peerGetCount() < NRF_SDH_BLE_TOTAL_LINK_COUNT, retval = NRF_ERROR_INVALID_STATE);

    memset(&scanParams, 0, sizeof(ble_gap_scan_params_t));
    scanParams.scan_phys = BLE_GAP_PHY_1MBPS;
    scanParams.interval  = aConfig->mScanInterval;
    scanParams.window    = aConfig->mScanWindow;
    scanParams.timeout   = BLE_GAP_SCAN_TIMEOUT_UNLIMITED;

    connParams.min_conn_interval = aConfig->mInterval;
    connParams.max_conn_interval = aConfig->mInterval;
    connParams.slave_latency     = BLE_DEFAULT_SLAVE_LATENCY;
    connParams.conn_sup_timeout  = aConfig->mInterval * BLE_DEFAULT_CONNECTION_RETRY;

    memset(&addr, 0, sizeof(ble_gap_addr_t));
    addr.addr_type = aPeerAddress->mType;
    memcpy(addr.addr, aPeerAddress->mAddress, OT_TOBLE_ADDRESS_SIZE);

    retval = sd_ble_gap_connect(&addr, &scanParams, &connParams, BLE_CFG_TAG);

    if (retval == NRF_SUCCESS)
    {
        sPeripheralPeer                = peerAllocate();
        sPeripheralPeer->mLinkType     = aConfig->mLinkType;
        sPeripheralPeer->mIsPeripheral = true;
        sBle.mState                    = kStateConnectionRequest;
    }
    else
    {
        otLogInfoPlat("[BLE]: sd_ble_gap_connect error: 0x%x", retval);
    }

exit:
    return (otTobleConnection *)sPeripheralPeer;
}

void otPlatTobleDisconnect(otInstance *aInstance, otTobleConnection *aConn)
{
    uint32_t retval;
    BlePeer *peer = (BlePeer *)aConn;

    OT_UNUSED_VARIABLE(aInstance);

    if (sBle.mState == kStateConnectionRequest)
    {
        otEXPECT_ACTION(false, retval = sd_ble_gap_connect_cancel());
    }

    otEXPECT_ACTION(peer->mConnHandle != BLE_CONN_HANDLE_INVALID, retval = NRF_ERROR_INVALID_STATE);

    retval = sd_ble_gap_disconnect(peer->mConnHandle, OT_BLE_HCI_REMOTE_USER_TERMINATED);

    if (retval != NRF_SUCCESS)
    {
        otLogInfoPlat("[BLE]: sd_ble_gap_disconnect error: 0x%x", retval);
    }

exit:
    return;
}

uint16_t otPlatTobleGetMtu(otInstance *aInstance, otTobleConnection *aConn)
{
    BlePeer *peer = (BlePeer *)aConn;

    OT_UNUSED_VARIABLE(aInstance);
    return peer->mAttMtu;
}

void otPlatTobleC2Subscribe(otInstance *aInstance, otTobleConnection *aConn, bool aSubscribe)
{
    uint32_t                 retval;
    ble_gattc_write_params_t params;
    uint8_t                  cccdVal[2];
    BlePeer *                peer = (BlePeer *)aConn;

    OT_UNUSED_VARIABLE(aInstance);

    cccdVal[0] = aSubscribe ? BLE_GATT_HVX_INDICATION : 0;
    cccdVal[1] = 0;

    memset(&params, 0, sizeof(ble_gattc_write_params_t));
    params.write_op = BLE_GATT_OP_WRITE_REQ;
    params.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    params.handle   = sBle.mC2CccdHandle;
    params.offset   = 0;
    params.len      = sizeof(cccdVal);
    params.p_value  = cccdVal;

    retval = sd_ble_gattc_write(peer->mConnHandle, &params);

    if (retval != NRF_SUCCESS)
    {
        sBle.mState = kStateGattSubscribing;
    }
    else
    {
        otLogInfoPlat("[BLE]: sd_ble_gattc_write error: 0x%x", retval);
    }
}

void otPlatTobleC1Write(otInstance *aInstance, otTobleConnection *aConn, const void *aBuffer, uint16_t aLength)
{
    uint32_t                 retval;
    ble_gattc_write_params_t params;
    BlePeer *                peer = (BlePeer *)aConn;

    memset(&params, 0, sizeof(ble_gattc_write_params_t));
    params.write_op = BLE_GATT_OP_WRITE_REQ;
    params.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    params.handle   = sBle.mC1Handle;
    params.offset   = 0;
    params.p_value  = aBuffer;
    params.len      = aLength;

    retval = sd_ble_gattc_write(peer->mConnHandle, &params);

    if (retval != NRF_SUCCESS)
    {
        otLogInfoPlat("[BLE]: sd_ble_gattc_write error: 0x%x", retval);
    }
    else
    {
        // peer->isSubscribing = false;
    }
}

