wgtdkp/openthread/examples/platforms/nrf528xx/src/toble.c
        otLogInfoPlat("BLE_L2CAP_EVT_CH_SETUP_REQUEST: mtu %d psm 0x%x local_cid=%d connectionId=%d",
                      chSetupRequest->tx_params.tx_mtu, chSetupRequest->le_psm, l2capEvt->local_cid,
                      l2capEvt->conn_handle);

        if (chSetupRequest->le_psm == BLE_L2CAP_PSM)
        {
            if ((peer = peerFind(connectionId)) != NULL)
            {
                peer->mLocalCid = l2capEvt->local_cid;
                peer->mLinkType = kConnectionLinkTypeL2Cap;
                bleL2capSendConnectionResponse(peer, 0, BLE_L2CAP_MTU);
            }
        }

        break;
    }

    case BLE_L2CAP_EVT_CH_SETUP:
    {
        ble_l2cap_evt_t *l2capEvt = &evt->evt.l2cap_evt;
        ble_data_t       sduBuf;

        otLogInfoPlat("BLE_L2CAP_EVT_CH_SETUP: local_cid=%d connectionId=%d, L2CAP connected", l2capEvt->local_cid,
                      l2capEvt->conn_handle);

        if (((peer = peerFind(connectionId))) != NULL && (peer->mIsPeripheral))
        {
            sPeripheralPeer = NULL;
            if (sDiagMode)
            {
                otPlatTobleDiagHandleConnectionIsReady(sInstance, (otTobleConnection *)peer, peer->mLinkType);
            }
            else
            {
                otPlatTobleHandleConnectionIsReady(sInstance, (otTobleConnection *)peer, peer->mLinkType);
            }
        }

        // TODO: Currently only 1 RX buffer is available.
        sduBuf.p_data = sL2capRxBuffer;
        sduBuf.len    = sizeof(sL2capRxBuffer);

        retval = sd_ble_l2cap_ch_rx(connectionId, l2capEvt->local_cid, &sduBuf);

        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_l2cap_ch_rx error: 0x%x", retval);
            assert(retval == NRF_SUCCESS);
        }

        break;
    }

    case BLE_L2CAP_EVT_CH_SETUP_REFUSED:
    {
        otLogInfoPlat("BLE_L2CAP_EVT_CH_SETUP_REFUSED");
        sd_ble_gap_disconnect(connectionId, OT_BLE_HCI_REMOTE_USER_TERMINATED);
        break;
    }

    case BLE_L2CAP_EVT_CH_RELEASED:
    {
        otLogInfoPlat("BLE_L2CAP_EVT_CH_RELEASED");
        break;
    }

    case BLE_L2CAP_EVT_CH_RX:
    {
        ble_l2cap_evt_t *      l2capEvt = &evt->evt.l2cap_evt;
        ble_l2cap_evt_ch_rx_t *chRx     = &l2capEvt->params.rx;
        otBleRadioPacket       packet;
        ble_data_t             sduBuf;
        uint8_t                channel_index;

        retval = sd_ble_gap_rssi_get(connectionId, &packet.mPower, &channel_index);

        packet.mValue  = chRx->sdu_buf.p_data;
        packet.mLength = MIN(l2capEvt->params.rx.sdu_buf.len, l2capEvt->params.rx.sdu_len);

        if ((peer = peerFind(l2capEvt->conn_handle)) != NULL)
        {
            if (sDiagMode)
            {
                otPlatTobleDiagL2CapFrameReceived(sInstance, (otTobleConnection *)peer, chRx->sdu_buf.p_data,
                                                  MIN(l2capEvt->params.rx.sdu_buf.len, l2capEvt->params.rx.sdu_len));
            }
            else
            {
                otPlatTobleL2CapFrameReceived(sInstance, (otTobleConnection *)peer, chRx->sdu_buf.p_data,
                                              MIN(l2capEvt->params.rx.sdu_buf.len, l2capEvt->params.rx.sdu_len));
            }
        }
        else
        {
            otLogInfoPlat("BLE_L2CAP_EVT_CH_RX: ConnectionId=%d Peer=NULL", l2capEvt->conn_handle);
        }

        // TODO: Currently only 1 RX buffer is available.
        sduBuf.p_data = sL2capRxBuffer;
        sduBuf.len    = sizeof(sL2capRxBuffer);

        retval = sd_ble_l2cap_ch_rx(connectionId, l2capEvt->local_cid, &sduBuf);

        if (retval != NRF_SUCCESS)
        {
            otLogInfoPlat("[BLE]: sd_ble_l2cap_ch_rx error: 0x%x", retval);
            assert(retval == NRF_SUCCESS);
        }

        break;
    }

    case BLE_L2CAP_EVT_CH_TX:
    {
        ble_l2cap_evt_t *l2capEvt = &evt->evt.l2cap_evt;

        if ((peer = peerFind(l2capEvt->conn_handle)) != NULL)
        {
            if (sDiagMode)
            {
                otPlatTobleDiagL2capSendDone(sInstance, (otTobleConnection *)peer);
            }
            else
            {
                otPlatTobleL2capSendDone(sInstance, (otTobleConnection *)peer);
            }
        }
        break;
    }

    default:
        otLogInfoPlat("[BLE]: Unhandled BLE event 0x%02x", evt->header.evt_id);
        break;
    }

exit:
    return;
}

NRF_SDH_BLE_OBSERVER(m_ot_ble_observer, 0, ble_evt_handler, NULL);

/*******************************************************************************
 * @section Definition of weak ToBLE platform functions.
 *******************************************************************************/
otError otPlatTobleScanStart(otInstance *aInstance, uint16_t aInterval, uint16_t aWindow)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aInterval);
    OT_UNUSED_VARIABLE(aWindow);

    return OT_ERROR_NONE;
}

otError otPlatTobleScanStop(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return OT_ERROR_NONE;
}

otError otPlatTobleAdvStart(otInstance *aInstance, const otTobleAdvConfig *aConfig)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConfig);

    return OT_ERROR_NONE;
}

otError otPlatTobleAdvStop(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return OT_ERROR_NONE;
}

//-------------------------------------

OT_TOOL_WEAK void otPlatTobleGapOnAdvReceived(otInstance *        aInstance,
                                              otTobleAdvType      aAdvType,
                                              otTobleRadioPacket *aAdvPacket)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aAdvType);
    OT_UNUSED_VARIABLE(aAdvPacket);
}

OT_TOOL_WEAK void otPlatTobleGapOnScanRespReceived(otInstance *aInstance, otTobleRadioPacket *aAdvPacket)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aAdvPacket);
}

OT_TOOL_WEAK void otPlatTobleHandleConnected(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleHandleDisconnected(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleHandleAdv(otInstance *          aInstance,
                                       otTobleAdvType        aAdvType,
                                       const otTobleAddress *aSource,
                                       const uint8_t *       aData,
                                       uint16_t              aLength,
                                       int8_t                aRssi)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aAdvType);
    OT_UNUSED_VARIABLE(aSource);
    OT_UNUSED_VARIABLE(aData);
    OT_UNUSED_VARIABLE(aLength);
    OT_UNUSED_VARIABLE(aRssi);
}

OT_TOOL_WEAK void otPlatTobleHandleConnectionIsReady(otInstance *              aInstance,
                                                     otTobleConnection *       aConn,
                                                     otTobleConnectionLinkType aLinkType)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aLinkType);
}

OT_TOOL_WEAK void otPlatTobleHandleC1WriteDone(otInstance *aInstance, otTobleConnection *aConn)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
}

OT_TOOL_WEAK void otPlatTobleHandleC2Indication(otInstance *       aInstance,
                                                otTobleConnection *aConn,
                                                const uint8_t *    aBuffer,
                                                uint16_t           aLength)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aBuffer);
    OT_UNUSED_VARIABLE(aLength);
}

OT_TOOL_WEAK void otPlatTobleHandleC2Subscribed(otInstance *aInstance, otTobleConnection *aConn, bool aIsSubscribed)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aConn);
    OT_UNUSED_VARIABLE(aIsSubscribed);
}

